lib/tasks/seed_databases.rake

INSERT INTO "posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-10-22 14:02:10.658996"], ["updated_at", "2019-10-22 14:02:10.658996"]]
INSERT INTO "games" ("name", "description", "date", "tagline", "filename", "created_at", "updated_at", "image_width", "image_height") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  task from_csv: :environment do
    csv_text = File.read('./db/seeds/posts.csv')
    csv = CSV.parse(csv_text, :headers => true)
    csv.each do |row|
      Post.create!(row.to_hash)
    end

    csv_text = File.read('./db/seeds/games.csv')
    csv = CSV.parse(csv_text, :headers => true)
    csv.each do |row|
      Game.create!(row.to_hash)