app/controllers/games_controller.rb

  def index
    @games = Game.order(date: :desc)
---
SELECT "games".* FROM "games" ORDER BY "games"."date" DESC

  def download
    @game ||= Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]