app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @post = Post.sluggable.find(params[:id])

SELECT "posts".* FROM "posts" ORDER BY "posts"."date" DESC
---
  def index
    @posts = Post.order(date: :desc)