app/controllers/static_pages_controller.rb

SELECT MAX(date) FROM "posts" LIMIT ?  [["LIMIT", 11]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."date" DESC LIMIT ?  [["LIMIT", 1]]
---
  def home
    @post = Post.order(date: :desc).first